In [558]:
from __future__ import division, print_function, unicode_literals
import matplotlib as mpl
import matplotlib.pyplot as plt
import pandas as pd
import numpy as np
from sklearn.tree import DecisionTreeClassifier
from sklearn.model_selection import train_test_split

In [559]:
training = pd.read_csv("train.csv")
training.head()
# printing to see data

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S

In [560]:
test = pd.read_csv("test.csv")
test.head()
#print to see data

,PassengerId,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,892,3,"Kelly, Mr. James",male,34.5,0,0,330911,7.8292,NaN,Q
1,893,3,"Wilkes, Mrs. James (Ellen Needs)",female,47.0,1,0,363272,7.0000,NaN,S
2,894,2,"Myles, Mr. Thomas Francis",male,62.0,0,0,240276,9.6875,NaN,Q
3,895,3,"Wirz, Mr. Albert",male,27.0,0,0,315154,8.6625,NaN,S
4,896,3,"Hirvonen, Mrs. Alexander (Helga E Lindqvist)",female,22.0,1,1,3101298,12.2875,NaN,S

In [561]:
test.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 418 entries, 0 to 417
Data columns (total 11 columns):
PassengerId    418 non-null int64
Pclass         418 non-null int64
Name           418 non-null object
Sex            418 non-null object
Age            332 non-null float64
SibSp          418 non-null int64
Parch          418 non-null int64
Ticket         418 non-null object
Fare           417 non-null float64
Cabin          91 non-null object
Embarked       418 non-null object
dtypes: float64(2), int64(4), object(5)
memory usage: 36.0+ KB

In [562]:
gender = pd.read_csv("gender_submission.csv")
gender.head(5)
# printing to see the data stucture need for submitting

   PassengerId  Survived
0          892         0
1          893         1
2          894         0
3          895         0
4          896         1

In [563]:
training.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 891 entries, 0 to 890
Data columns (total 12 columns):
PassengerId    891 non-null int64
Survived       891 non-null int64
Pclass         891 non-null int64
Name           891 non-null object
Sex            891 non-null object
Age            714 non-null float64
SibSp          891 non-null int64
Parch          891 non-null int64
Ticket         891 non-null object
Fare           891 non-null float64
Cabin          204 non-null object
Embarked       889 non-null object
dtypes: float64(2), int64(5), object(5)
memory usage: 83.6+ KB

In [564]:
x = training[["Embarked", "Fare", "Sex"]]
x.head()
# dropping other attribute

  Embarked     Fare     Sex
0        S   7.2500    male
1        C  71.2833  female
2        S   7.9250  female
3        S  53.1000  female
4        S   8.0500    male

In [565]:
y = test[["Embarked", "Fare", "Sex"]]
y.head()
# dropping other attribute

  Embarked     Fare     Sex
0        Q   7.8292    male
1        S   7.0000  female
2        Q   9.6875    male
3        S   8.6625    male
4        S  12.2875  female

In [566]:
emb= x.Embarked = x.Embarked.map(dict(S=1,C=2,Q=3))
emb.head()
# converting Embarked to float value

0    1.0
1    2.0
2    1.0
3    1.0
4    1.0
Name: Embarked, dtype: float64

In [567]:
y.Embarked = y.Embarked.map(dict(S=1.0,C=2.0,Q=3.0))
y.Embarked.head()
# converting Embarked to float value

0    3.0
1    1.0
2    3.0
3    1.0
4    1.0
Name: Embarked, dtype: float64

In [568]:
z =[]
for em in emb:
    if np.isnan(em):
        z.append(1.0)
    else:
        z.append(em)
x.Embarked = z
print(x.Embarked.head())
# filling in missing value from Embarked to set to 1.0 NOTE: only two missing values

0    1.0
1    2.0
2    1.0
3    1.0
4    1.0
Name: Embarked, dtype: float64

In [569]:
z = []
for fare in y.Fare:
    if np.isnan(fare):
        z.append(8.8)
    else:
        z.append(fare)
y.Fare = z
print (y.Fare.head())
#fill in missing value for Fare NOTE: only 1 is missing

0     7.8292
1     7.0000
2     9.6875
3     8.6625
4    12.2875
Name: Fare, dtype: float64

In [570]:
x.Sex = x.Sex.map(dict(male = 0, female = 1))
x.head()
# convert sex to float values NOTE: no missing values

   Embarked     Fare  Sex
0       1.0   7.2500    0
1       2.0  71.2833    1
2       1.0   7.9250    1
3       1.0  53.1000    1
4       1.0   8.0500    0

In [571]:
y.Sex = y.Sex.map(dict(male = 0, female = 1))
y.head()
# convert sex to float values NOTE: no missing values

   Embarked     Fare  Sex
0       3.0   7.8292    0
1       1.0   7.0000    1
2       3.0   9.6875    0
3       1.0   8.6625    0
4       1.0  12.2875    1

In [572]:
x.info()
# Updated training set

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 891 entries, 0 to 890
Data columns (total 3 columns):
Embarked    891 non-null float64
Fare        891 non-null float64
Sex         891 non-null int64
dtypes: float64(2), int64(1)
memory usage: 21.0 KB

In [573]:
y.info()
# Updated Test set

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 418 entries, 0 to 417
Data columns (total 3 columns):
Embarked    418 non-null float64
Fare        418 non-null float64
Sex         418 non-null int64
dtypes: float64(2), int64(1)
memory usage: 9.9 KB

In [574]:
train = x.values
tests = y.values
print (train)
print (tests)
# putting values into correct format/matrix

[[ 1.      7.25    0.    ]
 [ 2.     71.2833  1.    ]
 [ 1.      7.925   1.    ]
 ...
 [ 1.     23.45    1.    ]
 [ 2.     30.      0.    ]
 [ 3.      7.75    0.    ]]
[[ 3.      7.8292  0.    ]
 [ 1.      7.      1.    ]
 [ 3.      9.6875  0.    ]
 ...
 [ 1.      7.25    0.    ]
 [ 1.      8.05    0.    ]
 [ 2.     22.3583  0.    ]]

In [575]:
#decision Tree set 
#predict
#output to csv
#var = pd.DataFrame({"PassengerId": passenger actual id })

In [576]:
survived = training[["Survived"]].values
# grabbing survived values to be use for classifier

In [577]:
from sklearn.tree import DecisionTreeClassifier
# use DTC to creat a DT
decide = DecisionTreeClassifier(max_depth=8, random_state=1, max_leaf_nodes=16)
decide.fit(train,survived)
# fitting the data to DT

DecisionTreeClassifier(class_weight=None, criterion='gini', max_depth=8,
            max_features=None, max_leaf_nodes=16,
            min_impurity_decrease=0.0, min_impurity_split=None,
            min_samples_leaf=1, min_samples_split=2,
            min_weight_fraction_leaf=0.0, presort=False, random_state=1,
            splitter='best')

In [578]:
# make the prediction using test set
predict = pd.Series(decide.predict(tests));

In [579]:
# append the prediction results into correct format to output the data to a csv file
result = pd.DataFrame({'PassengerId' : test["PassengerId"]})
result.insert(1, 'Survived', value=predict)
print(result)

     PassengerId  Survived
0            892         0
1            893         1
2            894         0
3            895         0
4            896         1
5            897         0
6            898         1
7            899         0
8            900         1
9            901         0
10           902         0
11           903         0
12           904         1
13           905         0
14           906         1
15           907         1
16           908         0
17           909         0
18           910         1
19           911         1
20           912         0
21           913         0
22           914         1
23           915         0
24           916         1
25           917         0
26           918         1
27           919         0
28           920         0
29           921         0
..           ...       ...
388         1280         0
389         1281         0
390         1282         0
391         1283         1
392         1284         0
393         1285         0
394         1286         0
395         1287         1
396         1288         0
397         1289         1
398         1290         0
399         1291         0
400         1292         1
401         1293         0
402         1294         1
403         1295         0
404         1296         0
405         1297         0
406         1298         0
407         1299         0
408         1300         1
409         1301         1
410         1302         1
411         1303         1
412         1304         1
413         1305         0
414         1306         1
415         1307         0
416         1308         0
417         1309         0

[418 rows x 2 columns]

In [584]:
result[['PassengerId', 'Survived']].to_csv('./result.csv', index=False)
# out csv file to current folder call result

In [585]:
print (pd.read_csv("result.csv"))

     PassengerId  Survived
0            892         0
1            893         1
2            894         0
3            895         0
4            896         1
5            897         0
6            898         1
7            899         0
8            900         1
9            901         0
10           902         0
11           903         0
12           904         1
13           905         0
14           906         1
15           907         1
16           908         0
17           909         0
18           910         1
19           911         1
20           912         0
21           913         0
22           914         1
23           915         0
24           916         1
25           917         0
26           918         1
27           919         0
28           920         0
29           921         0
..           ...       ...
388         1280         0
389         1281         0
390         1282         0
391         1283         1
392         1284         0
393         1285         0
394         1286         0
395         1287         1
396         1288         0
397         1289         1
398         1290         0
399         1291         0
400         1292         1
401         1293         0
402         1294         1
403         1295         0
404         1296         0
405         1297         0
406         1298         0
407         1299         0
408         1300         1
409         1301         1
410         1302         1
411         1303         1
412         1304         1
413         1305         0
414         1306         1
415         1307         0
416         1308         0
417         1309         0

[418 rows x 2 columns]